---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceIsNoGoodForWall
source: html/8819a4af-65e3-2d59-d173-3cb97b126a28.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceIsNoGoodForWall Property

Defining face is not suitable for walls.

## Syntax (C#)
```csharp
public static FailureDefinitionId FaceIsNoGoodForWall { get; }
```